cs270hw10/app/controllers/calendars_controller.rb

SELECT "events".* FROM "events"
---
  def show
    @events = Event.all