cs270hw10/app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "location", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)